# def isTeenager(age, hasPermission):
#     return (age < 18 and not hasPermission) or (age == 18 and hasPermission)

# ფუნქცია isTeenager იღებს ორ პარამეტრს: ასაკს (რომელიც არის რიცხვი) და hasPermission (რომელიც არის ლოგიკური).
def isTeenager(age, hasPermission):

    # ის ჯერ ამოწმებს, არის თუ არა ასაკი 18 წელზე ნაკლები (ასაკი < 18), თუ ორივე პირობა შეესაბამება სიმართლეს
    if age < 18 and not hasPermission:
        # ის აბრუნებს False-ს, რაც მიუთითებს, რომ ადამიანი 18 წლამდეა და არ აქვს მართვის მოწმობის აღების ნებართვა.
        return False

    # შემდეგ ის ამოწმებს არის თუ არა ასაკი ზუსტად 18 (ასაკი == 18) თუ ორივე პირობა შეესაბამება სიმართლეს
    elif age == 18 and hasPermission:
        # ის აბრუნებს True-ს, რაც მიუთითებს, რომ ადამიანი არის 18 წლის და აქვს მართვის მოწმობის აღების ნებართვა.
        return True
    else:
        # თუ ზემოთ ჩამოთვლილი პირობებიდან არცერთი არ არის დაკმაყოფილებული, ის აბრუნებს False-ს.
        return False


print(isTeenager(16, False))
print(isTeenager(19, False))

'''
განმარტება:
ფუნქცია isTeenager იღებს ორ პარამეტრს: ასაკს (რომელიც არის რიცხვი) და hasPermission (რომელიც არის ლოგიკური)
ის ჯერ ამოწმებს, არის თუ არა ასაკი 18 წელზე ნაკლები (ასაკი <18) და აქვს თუ არა ნებართვა მცდარი (არ აქვს ნებართვა). თუ ორივე პირობა შეესაბამება სიმართლეს, ის აბრუნებს False-ს, რაც მიუთითებს, რომ ადამიანი 18 წლამდეა და არ აქვს მართვის მოწმობის აღების ნებართვა.
შემდეგ ის ამოწმებს არის თუ არა ასაკი ზუსტად 18 (ასაკი == 18) და აქვს თუ არა ნებართვა True (აქვს ნებართვა). თუ ორივე პირობა შეესაბამება სიმართლეს, ის აბრუნებს True-ს, რაც მიუთითებს, რომ ადამიანი არის 18 წლის და აქვს მართვის მოწმობის აღების ნებართვა.
თუ ზემოთ ჩამოთვლილი პირობებიდან არცერთი არ არის დაკმაყოფილებული, ის აბრუნებს False-ს.
'''


def isTeenager(age, hasPermission):
    return age >= 18


print(isTeenager(16, False))
print(isTeenager(19, True))
print(isTeenager(18, False))
